:PROPERTIES:
:ID: 18b0e215-6662-472e-9fea-99cf1680e285
:END:
#+title: Count Currencies by Market Tier
#+description: Count Currencies by Market Tier
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:currencies:
#+created: 2026-05-21
#+updated: 2026-05-21

#+begin_src sql
select market_tier, count(*) as count
from ores.currencies
where valid_to = '9999-12-31 23:59:59'::timestamptz
group by market_tier
order by count desc;
#+end_src

#+RESULTS:
#+begin_example
| market_tier | count |
|-------------+-------|
| emerging    |    80 |
| frontier    |    45 |
| g10         |    18 |
| exotic      |    15 |
#+end_example
